Tekla.Structures.AnalysisInternal.DotAnalysisBeamEnd
The serialization structure for AnalysisBeamEnd.

Tekla.Structures.AnalysisInternal.DotAnalysisBeamEnd._Profile
The profile at the beam end.

Tekla.Structures.AnalysisInternal.DotAnalysisBeamEnd._Eccentricity
The Eccentricity at the beam end.

Tekla.Structures.AnalysisInternal.DotAnalysisBeamEnd._Connectivity
The connectivity at the beam end.

Tekla.Structures.AnalysisInternal.DotAnalysisBeamEnd.ToStruct(Tekla.Structures.Analysis.AnalysisBeamEnd)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisBeamEnd.FromStruct(Tekla.Structures.Analysis.AnalysisBeamEnd)
DO NOT USE! For internal usage only!
P: P.